using System;

namespace _06.StrongNumber
{
    class Program
    {
        static void Main(string[] args)
        {
            int num = int.Parse(Console.ReadLine());  //въвеждаме си число
            int tempNum = num;  // вземаме една временна променлива tempNum, на която присвояваме стойността на num. Това го правим, за да работим с временната променлива и ако омажем нещо по нея, това да не се отрази на числото.
            int totalFactorialSum = 0;

            // Стъпка 1 - вземаме цифрите от едно число една по една
            while (tempNum > 0) // докато временната променлива е по-голяма от 0, влизаш вътре и правиш нещо
            {
                int digit = tempNum % 10; // това ни взема последната зифра на числото
                tempNum = tempNum / 10;  // махаме последната цифра от числото. По този начин сме взели последната цифра от зислото и манаваме към следващите цифри.

                // Стъпка 2 - смятаме фактуриел от едно число
                int currentFactorialSum = 1; // тъй като ще умножаваме, първоначалната стойност трябва да бъде 1, а не 0 (тъй като число * 0 = 0). Тук е сумата на факториелите на текущото число

                for (int i = 1; i <= digit; i++)  // въртим цикъл, като започваме с фактуриел на последната цифра
                {
                    currentFactorialSum *= i;  // ако искаме 5!, резултата е: 1*1 = 1; 1*2 = 2; 2*3 = 6; 6*4 = 24; 24 * 5 = 120
                }

                totalFactorialSum += currentFactorialSum;  // общата сума на факториелите
            }

            if (num == totalFactorialSum)  // накрая сравняваме дали числото е равно на сумата на факториелите на отделните му цифри
            {
                Console.WriteLine("yes");
            }
            else
            {
                Console.WriteLine("no");
            }
        }
    }
}
